Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSetHandler.CreateDimensionSet Method
Overload List
Name | Description
CreateDimensionSet(ViewBase, PointList, Vector, Double)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, Double, Double)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, Double, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
Top
See Also
Reference
StraightDimensionSetHandler Class
Tekla.Structures.Drawing Namespace